Autodesk.Revit.DB.Events.DocumentPrintedEventArgs.GetFailedViewElementIds
Returns ElementIds of the views that that failed to print (if any).
Returns:
ElementIds of the views that that failed to print (if any).
Since:
2010

Autodesk.Revit.DB.Events.DocumentPrintedEventArgs.GetPrintedViewElementIds
Returns ElementIds of the views that printed successfully.
Returns:
ElementIds of the views that printed successfully.
Since:
2010

Autodesk.Revit.DB.Events.DocumentPrintedEventArgs
The event arguments used by the DocumentPrinted event.
Since:
2010